Repository: kanefrayzy/pixera
Catalog: locale/*/LC_MESSAGES/django.po
Languages: de, es, pt

source: AI Gallery — ИИ-галерея и генерация
de: AI Gallery — KI-Galerie und Generierung
es: AI Gallery — galería y generación con IA
pt: AI Gallery — galeria e geração com IA

source: AI Gallery — современная галерея и генерация изображений ИИ. Тёмная/светлая тема, быстрый поиск, теги и тренды.
de: AI Gallery — moderne KI-Bildgalerie und Generator. Dunkel/Hell-Theme, schnelle Suche, Tags und Trends.
es: AI Gallery — galería moderna y generador de imágenes con IA. Tema oscuro/claro, búsqueda rápida, etiquetas y tendencias.
pt: AI Gallery — galeria moderna e gerador de imagens com IA. Tema escuro/claro, busca rápida, tags e tendências.

source: AI Gallery — генерация и галерея
de: AI Gallery — Generierung & Galerie
es: AI Gallery — generación y galería
pt: AI Gallery — geração e galeria

source: Минималистичный UI, плавные градиенты и качественная генерация изображений ИИ.
de: Minimalistische UI, sanfte Verläufe und hochwertige KI-Bildgenerierung.
es: Interfaz minimalista, degradados suaves y generación de imágenes con IA de alta calidad.
pt: UI minimalista, gradientes suaves e geração de imagens com IA de alta qualidade.

source: На главную
de: Zur Startseite
es: Ir al inicio
pt: Ir para o início

source: Главное меню
de: Hauptmenü
es: Menú principal
pt: Menu principal

source: Галерея
de: Galerie
es: Galería
pt: Galeria

source: Тренды
de: Trends
es: Tendencias
pt: Tendências

source: Генерация
de: Generieren
es: Generar
pt: Gerar

source: Выбрать язык
de: Sprache wählen
es: Elegir idioma
pt: Escolher idioma

source: Переключить тему
de: Theme umschalten
es: Cambiar tema
pt: Alternar tema

source: Тёмная
de: Dunkel
es: Oscuro
pt: Escuro

source: Светлая
de: Hell
es: Claro
pt: Claro

source: Кабинет
de: Dashboard
es: Panel
pt: Painel

source: Выйти
de: Abmelden
es: Cerrar sesión
pt: Sair

source: Войти
de: Anmelden
es: Iniciar sesión
pt: Entrar

source: Регистрация
de: Registrieren
es: Registrarse
pt: Criar conta

source: Открыть меню
de: Menü öffnen
es: Abrir menú
pt: Abrir menu

source: Меню
de: Menü
es: Menú
pt: Menu

source: Навигация
de: Navigation
es: Navegación
pt: Navegação

source: Главная
de: Start
es: Inicio
pt: Início

source: Личный кабинет
de: Konto
es: Cuenta
pt: Conta

source: Разделы
de: Bereiche
es: Secciones
pt: Seções

source: Компания
de: Unternehmen
es: Compañía
pt: Empresa

source: О нас
de: Über uns
es: Sobre nosotros
pt: Sobre nós

source: Связаться с нами
de: Kontakt
es: Contacto
pt: Contato

source: Политика конфиденциальности
de: Datenschutzerklärung
es: Política de privacidad
pt: Política de Privacidade

source: все права защищены
de: alle Rechte vorbehalten
es: todos los derechos reservados
pt: todos os direitos reservados

source: AI Gallery — генерация изображений, галерея и блог
de: AI Gallery — Bildgenerierung, Galerie & Blog
es: AI Gallery — generación de imágenes, galería y blog
pt: AI Gallery — geração de imagens, galeria e blog

source: Онлайн-платформа для генерации ИИ-изображений: мгновенная генерация, аккуратная галерея, редактор промптов, фильтры, тренды и блог с гайдами. Оптимизировано под SEO, работает в тёмной и светлой темах.
de: Online-Plattform für KI-Bildgenerierung: sofortige Ergebnisse, aufgeräumte Galerie, Prompt-Editor, Filter, Trends und Blog mit Guides. SEO-ready, läuft in dunklem und hellem Theme.
es: Plataforma online para generar imágenes con IA: creación instantánea, galería cuidada, editor de prompts, filtros, tendencias y blog con guías. Optimizada para SEO, funciona en temas oscuro y claro.
pt: Plataforma online para gerar imagens com IA: criação instantânea, galeria organizada, editor de prompts, filtros, tendências e blog com guias. Otimizada para SEO, funciona nos temas escuro e claro.

source: AI Gallery — генерация и поиск вдохновляющих изображений
de: AI Gallery — inspirierende Bilder generieren & finden
es: AI Gallery — genera y encuentra imágenes inspiradoras
pt: AI Gallery — gerar e encontrar imagens inspiradoras

source: AI Gallery — генерация и поиск изображений
de: AI Gallery — Bilder generieren & suchen
es: AI Gallery — generar y buscar imágenes
pt: AI Gallery — gerar e buscar imagens

source: Генерируйте идеи и находите вдохновение. Красивый интерфейс, стабильная очередь, SEO из коробки.
de: Generiere Ideen und finde Inspiration. Cleanes UI, stabile Queue, SEO out-of-the-box.
es: Genera ideas y encuentra inspiración. Interfaz limpia, cola estable y SEO listo para usar.
pt: Gere ideias e encontre inspiração. UI limpa, fila estável e SEO pronto para uso.

source: Создавайте и находите вдохновляющие изображения
de: Erstelle und entdecke inspirierende Bilder
es: Crea y descubre imágenes inspiradoras
pt: Crie e descubra imagens inspiradoras

source: Мгновенная генерация, аккуратная лента и умные фильтры — всё в одном месте.
de: Sofortige Generierung, aufgeräumter Feed und smarte Filter — alles an einem Ort.
es: Generación instantánea, feed ordenado y filtros inteligentes — todo en un mismo lugar.
pt: Geração instantânea, feed organizado e filtros inteligentes — tudo num só lugar.

source: Действия на главной
de: Aktionen der Startseite
es: Acciones de la portada
pt: Ações da página inicial

source: Начать генерацию
de: Mit Generierung starten
es: Empezar a generar
pt: Começar a gerar

source: Открыть галерею
de: Galerie öffnen
es: Abrir galería
pt: Abrir galeria

source: Доверие и показатели
de: Vertrauen & Kennzahlen
es: Confianza y métricas
pt: Confiança e métricas

source: сек
de: s
es: s
pt: s

source: среднее время генерации
de: durchschn. Generierungszeit
es: tiempo medio de generación
pt: tempo médio de geração

source: время доступности
de: Verfügbarkeit
es: disponibilidad
pt: disponibilidade

source: OG, JSON-LD, карта сайта
de: OG, JSON-LD, Sitemap
es: OG, JSON-LD, mapa del sitio
pt: OG, JSON-LD, mapa do site

source: безопасные фильтры
de: sichere Filter
es: filtros seguros
pt: filtros seguros

source: Почему именно мы
de: Warum wir
es: Por qué elegirnos
pt: Por que nós

source: Скорость, стабильность, продуманный UX и SEO-готовность по умолчанию.
de: Geschwindigkeit, Stabilität, durchdachtes UX und SEO-Readiness ab Werk.
es: Velocidad, estabilidad, UX pensado y SEO listo por defecto.
pt: Velocidade, estabilidade, UX pensado e SEO pronto por padrão.

source: Скорость
de: Geschwindigkeit
es: Velocidad
pt: Velocidade

source: Асинхронная очередь, кэширование статики и оптимизированные шаблоны дают предсказуемое время отклика.
de: Asynchrone Queue, Static-Caching und optimierte Templates liefern vorhersehbare Latenz.
es: Cola asíncrona, caché estática y plantillas optimizadas ofrecen latencia predecible.
pt: Fila assíncrona, cache de estáticos e templates otimizados entregam latência previsível.

source: Демо скорости
de: Speed-Demo
es: Demostración de velocidad
pt: Demo de velocidade

source: профилирование 26–30с
de: Profiling 26–30 s
es: perfilado 26–30 s
pt: perfil 26–30 s

source: Чистый дизайн
de: Klares Design
es: Diseño limpio
pt: Design limpo

source: Чёрно-белая база с оранжевыми акцентами, мягкие тени и адаптив от 320 px до 4K.
de: Schwarz-weiße Basis mit orangen Akzenten, weiche Schatten, responsiv von 320 px bis 4K.
es: Base en blanco y negro con acentos naranjas, sombras suaves y diseño responsive de 320 px a 4K.
pt: Base em preto e branco com detalhes em laranja, sombras suaves e layout responsivo de 320 px a 4K.

source: пиксель-перфект
de: pixel-perfect
es: pixel-perfect
pt: pixel-perfect

source: SEO-подготовка
de: SEO-Vorbereitung
es: Preparado para SEO
pt: Preparado para SEO

source: OG/Twitter метки, JSON-LD схемы, каноникал, валидная семантика и высокая скорость загрузки.
de: OG/Twitter-Tags, JSON-LD-Schemata, Canonical, valide Semantik und schnelle Ladezeiten.
es: Etiquetas OG/Twitter, esquemas JSON-LD, canonical, semántica válida y alta velocidad de carga.
pt: Tags OG/Twitter, esquemas JSON-LD, canonical, semântica válida e alta velocidade de carregamento.

source: валидаторы ✓
de: Validatoren ✓
es: validadores ✓
pt: validadores ✓

source: Безопасность
de: Sicherheit
es: Seguridad
pt: Segurança

source: SFW-фильтры, жалобы, приватность публикаций и бережное хранение медиа.
de: SFW-Filter, Meldungen, Beitrags-Privatsphäre und sorgfältige Medienspeicherung.
es: Filtros SFW, reportes, privacidad de publicaciones y almacenamiento cuidadoso de medios.
pt: Filtros SFW, denúncias, privacidade de publicações e armazenamento cuidadoso de mídia.

source: модерация
de: Moderation
es: moderación
pt: moderação

source: Демонстрация генерации
de: Generierungs-Demo
es: Demostración de generación
pt: Demonstração de geração

source: Реалистичное освещение, чистое кадрирование и сочные цвета — прямо из коробки.
de: Realistische Beleuchtung, sauberes Framing und kräftige Farben — direkt einsatzbereit.
es: Iluminación realista, encuadre limpio y colores intensos — listo desde el inicio.
pt: Iluminação realista, enquadramento limpo e cores vibrantes — pronto para uso.

source: Пример сгенерированного изображения
de: Beispiel eines generierten Bildes
es: Ejemplo de imagen generada
pt: Exemplo de imagem gerada

source: Золотой час, драматичное небо, объёмный свет
de: Goldene Stunde, dramatischer Himmel, volumetrisches Licht
es: Hora dorada, cielo dramático, luz volumétrica
pt: Hora dourada, céu dramático, luz volumétrica

source: Широкоугольный кадр, мягкий градиентный фон, реалистичные детали
de: Weitwinkel-Aufnahme, weicher Verlaufshintergrund, realistische Details
es: Toma gran angular, fondo con degradado suave, detalles realistas
pt: Grande angular, fundo em gradiente suave, detalhes realistas

source: Режимы генерации
de: Generierungsmodi
es: Modos de generación
pt: Modos de geração

source: Промпт
de: Prompt
es: Prompt
pt: Prompt

source: Параметры
de: Parameter
es: Parámetros
pt: Parâmetros

source: Результат
de: Ergebnis
es: Resultado
pt: Resultado

source: портрет женщины, естественный мягкий свет, 35мм, малая глубина резкости, пастельный фон, чистая композиция, лёгкий контровой свет
de: Porträt einer Frau, natürliches weiches Licht, 35 mm, geringe Schärfentiefe, pastellfarbener Hintergrund, klare Komposition, zartes Rim-Light
es: retrato de una mujer, luz suave natural, 35 mm, poca profundidad de campo, fondo pastel, composición limpia, ligero contra
pt: retrato de uma mulher, luz suave natural, 35 mm, baixa profundidade de campo, fundo pastel, composição limpa, leve contraluz

source: Шаги
de: Steps
es: Pasos
pt: Passos

source: Соотношение
de: Seitenverhältnis
es: Relación
pt: Proporção

source: Seed
es: Semilla

source: Миниатюра результата
de: Ergebnis-Thumbnail
es: Miniatura del resultado
pt: Miniatura do resultado

source: Готово за 26 секунд
de: Fertig in 26 Sekunden
es: Listo en 26 segundos
pt: Pronto em 26 segundos

source: Сохранено в галерее и доступно в «Моих обработках»
de: In der Galerie gespeichert und in „Meine Bearbeitungen“ verfügbar
es: Guardado en la galería y disponible en “Mis ediciones”
pt: Salvo na galeria e disponível em “Minhas edições”

source: Попробовать
de: Ausprobieren
es: Probar
pt: Experimentar

source: Смотреть похожие
de: Ähnliche ansehen
es: Ver similares
pt: Ver similares

source: Быстрый набросок промпта
de: Schneller Prompt-Entwurf
es: Borrador rápido de prompt
pt: Rascunho rápido de prompt

source: Опишите изображение
de: Beschreibe das Bild
es: Describe la imagen
pt: Descreva a imagem

source: Опишите изображение: стиль, свет, объектив, детали
de: Beschreibe das Bild: Stil, Licht, Objektiv, Details
es: Describe la imagen: estilo, luz, lente, detalles
pt: Descreva a imagem: estilo, luz, lente, detalhes

source: Сгенерировать набросок
de: Entwurf generieren
es: Generar borrador
pt: Gerar rascunho

source: Как это работает
de: So funktioniert’s
es: Cómo funciona
pt: Como funciona

source: Три шага — но мы покажем их как единый поток.
de: Drei Schritte — als ein nahtloser Flow dargestellt.
es: Tres pasos — presentados como un flujo único.
pt: Três passos — apresentados como um fluxo único.

source: Опишите кадр
de: Beschreibe die Aufnahme
es: Describe la toma
pt: Descreva a cena

source: Сцена, свет, оптика, настроение и ключевые детали — чем конкретнее, тем лучше.
de: Szene, Licht, Optik, Stimmung und Kerndetails — je konkreter, desto besser.
es: Escena, luz, óptica, ambiente y detalles clave — cuanto más concreto, mejor.
pt: Cena, luz, ótica, clima e detalhes-chave — quanto mais específico, melhor.

source: Мы обработаем
de: Wir verarbeiten
es: Procesamos
pt: Nós processamos

source: Задача попадёт в очередь. Оптимизированные модели обеспечат стабильный результат.
de: Der Auftrag kommt in die Queue. Optimierte Modelle sichern stabile Ergebnisse.
es: El trabajo pasa a la cola. Los modelos optimizados aseguran resultados estables.
pt: O job entra na fila. Modelos otimizados garantem um resultado estável.

source: Получите результат
de: Ergebnis erhalten
es: Obtén el resultado
pt: Obtenha o resultado

source: Изображение появится в вашей ленте и в «Моих обработках». Можно делиться и улучшать.
de: Das Bild erscheint im Feed und in „Meine Bearbeitungen“. Teilen und iterieren möglich.
es: La imagen aparecerá en tu feed y en “Mis ediciones”. Puedes compartir y mejorar.
pt: A imagem aparecerá no seu feed e em “Minhas edições”. Você pode compartilhar e melhorar.

source: Готовые сценарии
de: Use-Cases
es: Casos de uso
pt: Casos de uso

source: Подходит и для креативных задач, и для продуктовых команд.
de: Geeignet für kreative Aufgaben und Produktteams.
es: Ideal tanto para tareas creativas como para equipos de producto.
pt: Serve tanto para tarefas criativas quanto para equipes de produto.

source: Обложки и афиши
de: Cover & Plakate
es: Portadas y carteles
pt: Capas e cartazes

source: Быстрые обложки для подкастов и статей, подборка цветов и шрифтов.
de: Schnelle Cover für Podcasts und Artikel, kuratierte Farben und Schriften.
es: Portadas rápidas para podcasts y artículos, paletas y tipografías coherentes.
pt: Capas rápidas para podcasts e artigos, paletas e tipografias coerentes.

source: Маркетинговые макеты
de: Marketing-Mockups
es: Mockups de marketing
pt: Mockups de marketing

source: Баннеры, hero-картинки, иллюстрации к лендингам с единым стилем.
de: Banner, Hero-Bilder, Landing-Illustrationen im konsistenten Stil.
es: Banners, hero images e ilustraciones para landings con estilo consistente.
pt: Banners, imagens hero e ilustrações para landings com estilo consistente.

source: Концепт-арт
de: Concept Art
es: Concept art
pt: Arte conceitual

source: Мир, персонажи и объекты для питчей и прототипов.
de: Welten, Charaktere und Props für Pitches und Prototypen.
es: Mundos, personajes y props para pitches y prototipos.
pt: Mundos, personagens e objetos para pitches e protótipos.

source: Референсы
de: Referenzen
es: Referencias
pt: Referências

source: Быстрые референсы света, поз и окружения для фото- и видеосъёмок.
de: Schnelle Referenzen zu Licht, Posen und Umgebungen für Foto/Video.
es: Referencias rápidas de luz, poses y entornos para foto y vídeo.
pt: Referências rápidas de luz, poses e ambientes para foto e vídeo.

source: Фоны, композиции и подсветка товаров в едином направлении.
de: Hintergründe, Kompositionen und Produktbeleuchtung in einer Linie.
es: Fondos, composiciones e iluminación de productos en una misma línea.
pt: Fundos, composições e iluminação de produtos numa mesma linha.

source: Соцсети
de: Soziale Medien
es: Redes sociales
pt: Redes sociais

source: Серии постов в единой палитре и сетке с высокой читаемостью.
de: Post-Serien mit einheitlicher Palette und Grid, hohe Lesbarkeit.
es: Series de posts con paleta y grid unificados y alta legibilidad.
pt: Séries de posts com paleta e grid unificados e alta legibilidade.

source: Что отличает нас
de: Was uns auszeichnet
es: Qué nos diferencia
pt: O que nos diferencia

source: Функции, которые реально экономят время.
de: Funktionen, die wirklich Zeit sparen.
es: Funciones que realmente ahorran tiempo.
pt: Recursos que realmente poupam tempo.

source: Возможность
de: Funktion
es: Funcionalidad
pt: Recurso

source: Обычные сервисы
de: Übliche Dienste
es: Servicios típicos
pt: Serviços comuns

source: Генерация и галерея в одном интерфейсе
de: Generierung und Galerie in einem Interface
es: Generación y galería en una sola interfaz
pt: Geração e galeria numa única interface

source: Да
de: Ja
es: Sí
pt: Sim

source: Не всегда
de: Nicht immer
es: No siempre
pt: Nem sempre

source: SEO-разметка и каноникал
de: SEO-Markup und Canonical
es: Marcado SEO y canonical
pt: Marcação SEO e canonical

source: Редко
de: Selten
es: Raramente
pt: Raramente

source: Умные фильтры и тренды
de: Smarte Filter und Trends
es: Filtros inteligentes y tendencias
pt: Filtros inteligentes e tendências

source: Ограниченно
de: Begrenzt
es: Limitado
pt: Limitado

source: Тёмная/светлая темы
de: Dunkles/Helles Theme
es: Temas oscuro/claro
pt: Temas escuro/claro

source: Иногда
de: Manchmal
es: A veces
pt: Às vezes

source: Отзывы
de: Stimmen
es: Reseñas
pt: Depoimentos

source: Короткие впечатления от дизайнеров и авторов.
de: Kurze Eindrücke von Designer:innen und Autor:innen.
es: Breves impresiones de diseñadores y autores.
pt: Impressões curtas de designers e autores.

source: Впервые за долгое время генерация не мешает потоку работы — UI очень чистый.
de: Zum ersten Mal seit Langem stört die Generierung den Flow nicht — das UI ist sehr clean.
es: Por primera vez en mucho tiempo, la generación no interrumpe el flujo — la interfaz es muy limpia.
pt: Pela primeira vez em muito tempo, a geração não atrapalha o fluxo — a UI é bem limpa.

source: Даша, дизайнер
de: Dascha, Designerin
es: Dasha, diseñadora
pt: Dasha, designer

source: Карточки блога как в кейсбуках: удобно читать и сразу применять советы.
de: Blog-Karten wie in Casebooks: leicht zu lesen und sofort anwendbar.
es: Las tarjetas del blog parecen casebooks: fáciles de leer y aplicar al instante.
pt: Cards de blog como em casebooks: fáceis de ler e aplicar na hora.

source: Макс, маркетолог
de: Max, Marketer
es: Max, marketer
pt: Max, marketing

source: Хорошие параметры по умолчанию. Результаты получаются стабильно предсказуемыми.
de: Gute Defaults. Ergebnisse sind zuverlässig vorhersehbar.
es: Buenos valores por defecto. Los resultados son predecibles y consistentes.
pt: Bons padrões. Os resultados são consistentemente previsíveis.

source: Иван, иллюстратор
de: Iwan, Illustrator
es: Iván, ilustrador
pt: Ivan, ilustrador

source: Навигация по отзывам
de: Rezensions-Navigation
es: Navegación de reseñas
pt: Navegação dos depoimentos

source: Первый
de: Erster
es: Primero
pt: Primeiro

source: Второй
de: Zweiter
es: Segundo
pt: Segundo

source: Третий
de: Dritter
es: Tercero
pt: Terceiro

source: Свежие статьи из блога
de: Aktuelle Blog-Artikel
es: Artículos recientes del blog
pt: Artigos recentes do blog

source: Обновления сервиса, инструкции и кейсы пользователей.
de: Service-Updates, Anleitungen und Nutzer-Case-Studies.
es: Actualizaciones del servicio, guías y casos de usuarios.
pt: Atualizações do serviço, tutoriais e casos de usuários.

source: Написать статью
de: Artikel schreiben
es: Escribir artículo
pt: Escrever artigo

source: Частые вопросы
de: FAQ
es: Preguntas frecuentes
pt: Perguntas frequentes

source: Короткие ответы о генерации, темах и ограничениях.
de: Kurze Antworten zu Generierung, Themes und Einschränkungen.
es: Respuestas breves sobre generación, temas y limitaciones.
pt: Respostas curtas sobre geração, temas e limitações.

source: Сколько занимает генерация?
de: Wie lange dauert die Generierung?
es: ¿Cuánto tarda la generación?
pt: Quanto tempo leva a geração?

source: В среднем 25–30 секунд при стандартной нагрузке. Задачи обрабатываются асинхронно.
de: Im Schnitt 25–30 Sekunden bei normaler Last. Aufträge werden asynchron verarbeitet.
es: De media 25–30 segundos con carga estándar. Las tareas se procesan de forma asíncrona.
pt: Em média, 25–30 segundos com carga padrão. As tarefas são processadas de forma assíncrona.

source: Поддерживаются тёмная и светлая темы?
de: Werden dunkles und helles Theme unterstützt?
es: ¿Se admiten los temas oscuro y claro?
pt: Os temas claro e escuro são suportados?

source: Да, темы можно переключать в хедере. Выбор сохраняется на устройстве.
de: Ja, Umschalten im Header. Die Auswahl wird auf deinem Gerät gespeichert.
es: Sí, puedes cambiar el tema en el header. La elección se guarda en tu dispositivo.
pt: Sim, altere o tema no cabeçalho. A escolha é salva no seu dispositivo.

source: Есть ли ограничения по контенту?
de: Gibt es Inhaltsbeschränkungen?
es: ¿Hay restricciones de contenido?
pt: Há restrições de conteúdo?

source: Мы используем SFW-фильтры и модерируем публичную ленту.
de: Wir nutzen SFW-Filter und moderieren den öffentlichen Feed.
es: Usamos filtros SFW y moderamos el feed público.
pt: Usamos filtros SFW e moderamos o feed público.

source: Можно ли улучшать готовую картинку?
de: Kann ich ein fertiges Bild verbessern?
es: ¿Se puede mejorar una imagen ya generada?
pt: Posso melhorar uma imagem pronta?

source: Да, доступен повторный прогон с изменённым промптом и параметрами.
de: Ja, erneutes Ausführen mit geändertem Prompt und Parametern ist möglich.
es: Sí, puedes volver a ejecutarla con prompt y parámetros modificados.
pt: Sim, é possível reexecutar com prompt e parâmetros modificados.

source: Готовы начать?
de: Bereit loszulegen?
es: ¿Listo para empezar?
pt: Pronto para começar?

source: Создавайте, делитесь и находите лучшее — в пару кликов.
de: Erstellen, teilen und das Beste finden — in wenigen Klicks.
es: Crea, comparte y encuentra lo mejor — en pocos clics.
pt: Crie, compartilhe e encontre o melhor — em poucos cliques.

source: Призывы к действию
de: Call-to-Actions
es: Llamadas a la acción
pt: Chamadas para ação

source: Создать изображение
de: Bild erstellen
es: Crear imagen
pt: Criar imagem
